In [1]:
from pandas import Series, DataFrame 
import pandas as pd 

#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [2]:
dfClass.sort_values("국어", ascending=False)

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [3]:
dfClass["전체"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [4]:
dfClass["평균"] = (dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3

In [5]:
dfClass.sort_values("평균", ascending=False)

   학급   이름   국어  영어   수학   전체         평균
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000

In [6]:
dfClass.groupby("학급")["국어"].mean()

학급
1    90.0
2    97.5
Name: 국어, dtype: float64

In [7]:
dfClass.groupby("학급").agg(국어평균=("국어","mean"), 
            수학평균=("수학","mean"),
            영어평균=("영어","mean"), 
            갯수=("학급","count"))

    국어평균       수학평균       영어평균  갯수
학급
1   90.0  83.333333  86.333333   3
2   97.5  96.000000  93.500000   2